Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/qei.h
#define QEI_INDXHLDINV_Msk                    _UINT32_(0x00000000)                                 /* (QEI_INDXHLDINV) Register Mask  */


/* -------- QEI_QEIICC : (QEI Offset: 0xB0) (R/W 32) QEI Initialize/Capture/Compare Register -------- */
#define QEI_QEIICC_QEIICC_Pos                 _UINT32_(0)                                          /* (QEI_QEIICC) 32-bit Initialize/Capture/Compare High bits Position */
#define QEI_QEIICC_QEIICC_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_QEIICC_QEIICC_Pos)      /* (QEI_QEIICC) 32-bit Initialize/Capture/Compare High bits Mask */
#define QEI_QEIICC_QEIICC(value)              (QEI_QEIICC_QEIICC_Msk & (_UINT32_(value) << QEI_QEIICC_QEIICC_Pos)) /* Assignment of value for QEIICC in the QEI_QEIICC register */
#define QEI_QEIICC_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_QEIICC) Register Mask  */


/* -------- QEI_QEIICCCLR : (QEI Offset: 0xB4) (R/W 32) Bit clear register -------- */
#define QEI_QEIICCCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEIICCCLR) Bit clear register  Reset Value */

#define QEI_QEIICCCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEIICCCLR) Register Mask  */


/* -------- QEI_QEIICCSET : (QEI Offset: 0xB8) (R/W 32) Bit set register -------- */
#define QEI_QEIICCSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEIICCSET) Bit set register  Reset Value */

#define QEI_QEIICCSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEIICCSET) Register Mask  */


/* -------- QEI_QEIICCINV : (QEI Offset: 0xBC) (R/W 32) Bit invert register -------- */
#define QEI_QEIICCINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEIICCINV) Bit invert register  Reset Value */

#define QEI_QEIICCINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEIICCINV) Register Mask  */


/* -------- QEI_QEICMPL : (QEI Offset: 0xC0) (R/W 32) Capture Low Register -------- */
#define QEI_QEICMPL_QEICMPL_Pos               _UINT32_(0)                                          /* (QEI_QEICMPL) 32-bit Compare Low Value bits Position */
#define QEI_QEICMPL_QEICMPL_Msk               (_UINT32_(0xFFFFFFFF) << QEI_QEICMPL_QEICMPL_Pos)    /* (QEI_QEICMPL) 32-bit Compare Low Value bits Mask */
#define QEI_QEICMPL_QEICMPL(value)            (QEI_QEICMPL_QEICMPL_Msk & (_UINT32_(value) << QEI_QEICMPL_QEICMPL_Pos)) /* Assignment of value for QEICMPL in the QEI_QEICMPL register */
#define QEI_QEICMPL_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (QEI_QEICMPL) Register Mask  */


/* -------- QEI_QEICMPLCLR : (QEI Offset: 0xC4) (R/W 32) Bit clear register -------- */
#define QEI_QEICMPLCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QEICMPLCLR) Bit clear register  Reset Value */

#define QEI_QEICMPLCLR_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QEICMPLCLR) Register Mask  */


/* -------- QEI_QEICMPLSET : (QEI Offset: 0xC8) (R/W 32) Bit set register -------- */
#define QEI_QEICMPLSET_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QEICMPLSET) Bit set register  Reset Value */

#define QEI_QEICMPLSET_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QEICMPLSET) Register Mask  */


/* -------- QEI_QEICMPLINV : (QEI Offset: 0xCC) (R/W 32) Bit invert register -------- */
#define QEI_QEICMPLINV_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QEICMPLINV) Bit invert register  Reset Value */

#define QEI_QEICMPLINV_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QEICMPLINV) Register Mask  */


/* QEI register offsets definitions */
#define QEI_QEICON_REG_OFST            _UINT32_(0x00)      /* (QEI_QEICON) QEI Control Register Offset */
#define QEI_QEICONCLR_REG_OFST         _UINT32_(0x04)      /* (QEI_QEICONCLR) Bit clear register Offset */
#define QEI_QEICONSET_REG_OFST         _UINT32_(0x08)      /* (QEI_QEICONSET) Bit set register Offset */
#define QEI_QEICONINV_REG_OFST         _UINT32_(0x0C)      /* (QEI_QEICONINV) Bit invert register Offset */
#define QEI_QEIIOC_REG_OFST            _UINT32_(0x10)      /* (QEI_QEIIOC) QEI I/O Control Register Offset */
#define QEI_QQEIIOCCLR_REG_OFST        _UINT32_(0x14)      /* (QEI_QQEIIOCCLR) Bit clear register Offset */
#define QEI_QEIIOCSET_REG_OFST         _UINT32_(0x18)      /* (QEI_QEIIOCSET) Bit set register Offset */
#define QEI_QEIIOCINV_REG_OFST         _UINT32_(0x1C)      /* (QEI_QEIIOCINV) Bit invert register Offset */
#define QEI_QEISTAT_REG_OFST           _UINT32_(0x20)      /* (QEI_QEISTAT) QEI Status Register Offset */
#define QEI_QEISTATCLR_REG_OFST        _UINT32_(0x24)      /* (QEI_QEISTATCLR) Bit clear register Offset */
#define QEI_QEISTATSET_REG_OFST        _UINT32_(0x28)      /* (QEI_QEISTATSET) Bit set register Offset */
#define QEI_QEISTATINV_REG_OFST        _UINT32_(0x2C)      /* (QEI_QEISTATINV) Bit invert register Offset */
#define QEI_POSCNT_REG_OFST            _UINT32_(0x30)      /* (QEI_POSCNT) Position Counter Register Offset */
#define QEI_POSCNTCLR_REG_OFST         _UINT32_(0x34)      /* (QEI_POSCNTCLR) Bit clear register Offset */
#define QEI_POSCNTSET_REG_OFST         _UINT32_(0x38)      /* (QEI_POSCNTSET) Bit set register Offset */
#define QEI_POSCNTINV_REG_OFST         _UINT32_(0x3C)      /* (QEI_POSCNTINV) Bit invert register Offset */
#define QEI_POSHLD_REG_OFST            _UINT32_(0x40)      /* (QEI_POSHLD) Position Count Hold Register Offset */
#define QEI_POSHLDCLR_REG_OFST         _UINT32_(0x44)      /* (QEI_POSHLDCLR) Bit clear register Offset */
#define QEI_POSHLDSET_REG_OFST         _UINT32_(0x48)      /* (QEI_POSHLDSET) Bit set register Offset */
#define QEI_POSHLDINV_REG_OFST         _UINT32_(0x4C)      /* (QEI_POSHLDINV) Bit invert register Offset */
#define QEI_VELCNT_REG_OFST            _UINT32_(0x50)      /* (QEI_VELCNT) Velocity Counter Register Offset */
#define QEI_VELCNTCLR_REG_OFST         _UINT32_(0x54)      /* (QEI_VELCNTCLR) Bit clear register Offset */
#define QEI_VELCNTSET_REG_OFST         _UINT32_(0x58)      /* (QEI_VELCNTSET) Bit set register Offset */
#define QEI_VELCNTINV_REG_OFST         _UINT32_(0x5C)      /* (QEI_VELCNTINV) Bit invert register Offset */
#define QEI_VELHLD_REG_OFST            _UINT32_(0x60)      /* (QEI_VELHLD) Velocity Counter Holding Register Offset */
#define QEI_VELHLDCLR_REG_OFST         _UINT32_(0x64)      /* (QEI_VELHLDCLR) Bit clear register Offset */
#define QEI_VELHLDSET_REG_OFST         _UINT32_(0x68)      /* (QEI_VELHLDSET) Bit set register Offset */
#define QEI_VELHLDINV_REG_OFST         _UINT32_(0x6C)      /* (QEI_VELHLDINV) Bit invert register Offset */
#define QEI_INTTMR_REG_OFST            _UINT32_(0x70)      /* (QEI_INTTMR) Interval Timer Register Offset */
#define QEI_INTTMRCLR_REG_OFST         _UINT32_(0x74)      /* (QEI_INTTMRCLR) Bit clear register Offset */
#define QEI_INTTMRSET_REG_OFST         _UINT32_(0x78)      /* (QEI_INTTMRSET) Bit set register Offset */
#define QEI_INTTMRINV_REG_OFST         _UINT32_(0x7C)      /* (QEI_INTTMRINV) Bit invert register Offset */
#define QEI_INTHLD_REG_OFST            _UINT32_(0x80)      /* (QEI_INTHLD) Interval Timer Holding Register Offset */
#define QEI_INTHLDCLR_REG_OFST         _UINT32_(0x84)      /* (QEI_INTHLDCLR) Bit clear register Offset */
#define QEI_INTHLDSET_REG_OFST         _UINT32_(0x88)      /* (QEI_INTHLDSET) Bit set register Offset */
#define QEI_INTHLDINV_REG_OFST         _UINT32_(0x8C)      /* (QEI_INTHLDINV) Bit invert register Offset */
#define QEI_INDXCNT_REG_OFST           _UINT32_(0x90)      /* (QEI_INDXCNT) Index Counter Register Offset */
#define QEI_INDXCNTCLR_REG_OFST        _UINT32_(0x94)      /* (QEI_INDXCNTCLR) Bit clear register Offset */
#define QEI_INDXCNTSET_REG_OFST        _UINT32_(0x98)      /* (QEI_INDXCNTSET) Bit set register Offset */
#define QEI_INDXCNTINV_REG_OFST        _UINT32_(0x9C)      /* (QEI_INDXCNTINV) Bit invert register Offset */
#define QEI_INDXHLD_REG_OFST           _UINT32_(0xA0)      /* (QEI_INDXHLD) Index Counter Holding Register Offset */
#define QEI_INDXHLDCLR_REG_OFST        _UINT32_(0xA4)      /* (QEI_INDXHLDCLR) Bit clear register Offset */
#define QEI_INDXHLDSET_REG_OFST        _UINT32_(0xA8)      /* (QEI_INDXHLDSET) Bit set register Offset */
#define QEI_INDXHLDINV_REG_OFST        _UINT32_(0xAC)      /* (QEI_INDXHLDINV) Bit invert register Offset */
#define QEI_QEIICC_REG_OFST            _UINT32_(0xB0)      /* (QEI_QEIICC) QEI Initialize/Capture/Compare Register Offset */
#define QEI_QEIICCCLR_REG_OFST         _UINT32_(0xB4)      /* (QEI_QEIICCCLR) Bit clear register Offset */
#define QEI_QEIICCSET_REG_OFST         _UINT32_(0xB8)      /* (QEI_QEIICCSET) Bit set register Offset */
#define QEI_QEIICCINV_REG_OFST         _UINT32_(0xBC)      /* (QEI_QEIICCINV) Bit invert register Offset */
#define QEI_QEICMPL_REG_OFST           _UINT32_(0xC0)      /* (QEI_QEICMPL) Capture Low Register Offset */
#define QEI_QEICMPLCLR_REG_OFST        _UINT32_(0xC4)      /* (QEI_QEICMPLCLR) Bit clear register Offset */
#define QEI_QEICMPLSET_REG_OFST        _UINT32_(0xC8)      /* (QEI_QEICMPLSET) Bit set register Offset */
#define QEI_QEICMPLINV_REG_OFST        _UINT32_(0xCC)      /* (QEI_QEICMPLINV) Bit invert register Offset */

